
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

110-user Stata network perpetual license:
       Serial number:  401506201178
         Licensed to:  Brown University
                       Brown University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  Maximum number of variables is set to 5000; see help set_maxvar.

. do "basic_functionality.do" 

. version 14

. adopath + ../../ado
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/ado/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/ryankessler/Library/Application Support/Stata/ado/pe
> rsonal/"
  [5]  (PLUS)      "/Users/ryankessler/Library/Application Support/Stata/ado/pl
> us/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../../ado"

. set matsize 2000

. set seed 1928384

. 
. program main
  1.     test_return_function 
  2. 
.     matrix non_square = (1, 2 \ 3, 4 \ 5, 6)
  3.     test_wrong_covariance_matrix, matr(non_square)
  4. 
.     matrix negative_definite = (-3, 0, 0 \ 0, -2, 0 \ 0, 0, -1)
  5.     test_wrong_covariance_matrix, matr(negative_definite)
  6. 
.     test_wrong_number_of_simulations, number(100.5)    
  7.     test_wrong_number_of_simulations, number(-5) 
  8. 
.     test_wrong_confidence_level, level(1)
  9.     test_wrong_confidence_level, level(0)
 10.     test_wrong_confidence_level, level(-0.5)
 11. end

. 
. program test_return_function
  1.     sysuse auto, clear
  2. 
.     reg mpg price weight trunk 
  3.     matrix vcov_matrix = e(V)
  4. 
.     estimate_supt_critical_value, vcov_matrix(vcov_matrix)
  5.     assert "`r(critical_value)'" != ""
  6. 
.     di "Test passed"
  7. end 

. 
. program test_wrong_covariance_matrix
  1.     syntax, matr(name)
  2. 
.     cap estimate_supt_critical_value, vcov_matrix(matr)
  3.     assert _rc > 0
  4. 
.     di "Test passed"
  5. end

. 
. program test_wrong_number_of_simulations
  1.     syntax, number(real)
  2. 
.     matrix positive_definite = (1, 0.5 \ 0.5, 1)
  3.     cap estimate_supt_critical_value, vcov_matrix(positive_definite) num_s
> im(number)
  4.     assert _rc > 0
  5. 
.     di "Test passed"
  6. end

. 
. program test_wrong_confidence_level
  1.     syntax, level(real)
  2. 
.     matrix positive_definite = (1, 0.5 \ 0.5, 1)
  3.     cap estimate_supt_critical_value, vcov_matrix(positive_definite) conf_
> level(level)
  4.     assert _rc > 0
  5.     
.     di "Test passed"
  6. end

. 
. * EXECUTE
. main
(1978 Automobile Data)

      Source |       SS           df       MS      Number of obs   =        74
-------------+----------------------------------   F(3, 70)        =     44.55
       Model |  1603.57067         3  534.523558   Prob > F        =    0.0000
    Residual |  839.888787        70  11.9984112   R-squared       =    0.6563
-------------+----------------------------------   Adj R-squared   =    0.6415
       Total |  2443.45946        73  33.4720474   Root MSE        =    3.4639

------------------------------------------------------------------------------
         mpg |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       price |  -.0001035   .0001636    -0.63   0.529    -.0004298    .0002228
      weight |  -.0054181   .0007962    -6.81   0.000    -.0070061   -.0038302
       trunk |  -.1024431   .1283954    -0.80   0.428    -.3585196    .1536335
       _cons |   39.70451   1.659272    23.93   0.000     36.39519    43.01382
------------------------------------------------------------------------------
Test passed
Test passed
Test passed
Test passed
Test passed
Test passed
Test passed
Test passed

. 
end of do-file
